Tekla Open API Reference for Tekla Structures 2025
Distance.PointToLine Method
 Returns the distance between the given point and line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static double PointToLine(
	Point Point,
	Line Line
)
Public Shared Function PointToLine (
	Point As Point,
	Line As Line
) As Double
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be used.
Line
Type: Tekla.Structures.Geometry3d.Line
The line to be used.
Return Value
Type: Double
The distance between the given point and line.
See Also
Reference
Distance Class
Tekla.Structures.Geometry3d Namespace